app/views/users/all.html.erb

<% provide(:title, t("users.all")) %>
<h1><% t("users.all")%></h1>
---
SELECT `users`.* FROM `users`