app/controllers/account_activations_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'chihieu8320@gmail.com' LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2021-12-01 05:29:11.720837', `users`.`activated` = TRUE WHERE `users`.`id` = 117
UPDATE `users` SET `users`.`updated_at` = '2021-12-01 05:29:11.730404', `users`.`activated_at` = '2021-12-01 05:29:11' WHERE `users`.`id` = 117
---
  def edit
    user = User.find_by(email: params[:email])
    if user && !user.activated? && user.authenticated?(:activation, params[:id])
      user.update_attribute(:activated, true)
      user.update_attribute(:activated_at, Time.zone.now)