app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `activation_digest`) VALUES ('vochihieu', 'vochihieu1@gmail.com', '2021-12-01 03:45:18.308334', '2021-12-01 03:45:18.308334', '$2a$10$xCn3P1EPrNh3jedcBbCgG.L5KN9joEoRVmp7MQF/6hhSDjsi/.h/S', '$2a$10$/vHXC3mlZmImtOd.OV28JuBkjpcdOIwkBb.wJUpUzQdGcx9Hw.QgW')

  def index
    @users = User.paginate(page: params[:page], per_page: 8)
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 8 OFFSET 0

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
      flash[:success] = t "users.update"
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 121 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2021-12-06 14:34:55.461991', `users`.`password_digest` = '$2a$10$HMuHy6tk20u9TxccdJAwAOWzFWKZs5rRIwBctjfLSoAhMOBErsYQ2' WHERE `users`.`id` = 105
UPDATE `users` SET `users`.`updated_at` = '2021-12-02 10:22:11.639818', `users`.`password_digest` = '$2a$10$.ENp4TeXICClzhJGUeLo/uxqOXPB4XJHmELUnZQmRNHDJazSoXdCm' WHERE `users`.`id` = 121

  def correct_user
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 105 LIMIT 1

  def destroy
    User.find(params[:id]).destroy
    flash[:success] = t "users.delete"
---
DELETE FROM `users` WHERE `users`.`id` = 4
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1